{
  "comments": {
    "data": [
      {
        "created_time": "2016-03-03T04:07:56+0000", 
        "from": {
          "id": "10155378191483710", 
          "name": "Amy Stein"
        }, 
        "id": "1674724249460452", 
        "message": "O'Connor was the christian, Andrew Norman was the humanist, I think you may have mixed them up"
      }, 
      {
        "created_time": "2016-03-03T04:12:36+0000", 
        "from": {
          "id": "10159723812655430", 
          "name": "Stephanie C. Farenik"
        }, 
        "id": "1674724856127058", 
        "message": "Then you for this post!"
      }, 
      {
        "created_time": "2016-03-03T04:12:47+0000", 
        "from": {
          "id": "10159723812655430", 
          "name": "Stephanie C. Farenik"
        }, 
        "id": "1674724879460389", 
        "message": "Thank*"
      }, 
      {
        "created_time": "2016-03-03T04:49:14+0000", 
        "from": {
          "id": "10208514289294470", 
          "name": "Chelsea Spencer"
        }, 
        "id": "1674730546126489", 
        "message": "Thanks Nathan, it was discouraging to hear a discussion more directed at personally trying to undermine Christianty and pegging it as violent in nature rather than discussing morality in general and how it arises from a secular point of view."
      }, 
      {
        "created_time": "2016-03-03T05:33:38+0000", 
        "from": {
          "id": "10155778909905867", 
          "name": "Micah J. Farenik"
        }, 
        "id": "1674737459459131", 
        "message": "This is well thought out, and the points you make are sound.  Thanks for compiling them into one post.  In regard to the first thing you said though, I think the thing he was highlighting is that it is strange to glorify requesting a man to slaughter his son."
      }
    ], 
    "paging": {
      "cursors": {
        "after": "WTI5dGJXVnVkRjlqZAFhKemIzSTZANVFkzTkRjek56UTFPVFExT1RFek1Ub3hORFUyT1Rnek1qRTQZD", 
        "before": "WTI5dGJXVnVkRjlqZAFhKemIzSTZANVFkzTkRjeU5ESTBPVFEyTURRMU1qb3hORFUyT1RjNE1EYzIZD"
      }
    }
  }, 
  "from": {
    "id": "10215439423678604", 
    "name": "Nathan Studanski"
  }, 
  "id": "1573851542881057_1674723406127203", 
  "message": "Figured the Foundations lecture is worthy of addressing since it replaced Shift. (Lengthy post, so hit the continue reading). Here's some reading and encouragement regarding the unjustified and incorrect claims made by Andy at the Round Table discussion. Don't be discouraged or frustrated about anything Norman (the humanist) said, from a philosophical standpoint he said very little that was actually sound. I'm sure there's more as well, so feel free to bring up in the comments anything else you had questions about or found encouraging. \n\n1) Abraham's blind faith. He never explained why it was negative, but here's a couple perspectives on what the story actually entails.\n\nhttp://robbellcom.tumblr.com/post/66792774855/what-is-the-bible-part-6\nThe very point of it is that God did not end up forcing Abraham to sacrifice his son, which is contrary to the other gods at the time.\n\nhttps://nathanstudanski.wordpress.com/2015/11/24/my-first-sermon/\nPlugging my own writing here, the story is much more symbolic and foreshadowing of Jesus than he gave credit.\n\n2) Slavery as negative- Apparently because America had blacks as slaves means the Bible had the same view. Slavery in the times of the Old Testament was not about race. Rather, it was about economic and social status, as was in the honor/shame culture. You could sell yourself for 6 years to pay for a debt, and you'd very likely be a slave and have slaves based on the social hierarchy where having followers helps your social status. \n\nAcademic view of slavery in NT- it is much more symbolic of what our relationship with Jesus should be. \nhttp://www.ctsfw.edu/document.doc?id=214\n\n3) Violence and his uncorrelated claims. I'm assuming his only references were to the OT, because he never attempted to justify his claims about modern-day Christians being violent. Similarly, his causation/correlation were uncited and do not prove anything. There's some examples here, so be careful about watching Nic Cage movies, since it correlates very well with death by drowning in a swimming pool. http://tylervigen.com/spurious-correlations\n\nAre we viewing the violence as moral from today's standpoint, or 4000 years ago? Because if we viewed it as moral today, that'd be a problem. At the time, Christianity was very progressive in its views. \nhttp://robbellcom.tumblr.com/post/67678046281/what-is-the-bible-part-13\n\n4) His view of the Bible. Of course if you're looking to come in with the lens of assuming Christianity to be bad, you're gonna shift things into your perspective. http://robbellcom.tumblr.com/post/68912921168/what-is-the-bible-part-17-assumptions-and-aa . He viewed everything based on the OT, with the exception of blasphemy of the Holy Spirit. Romans 8 is all about how Jesus fulfilled the requirements of the law. He also made it seem as if we have no evidence. Romans 1:20 \"For since the creation of the world God's invisible qualities--his eternal power and divine nature--have been clearly seen, being understood from what has been made, so that people are without excuse.\" No evidence for resurrection. Okay, I'll run with that. So Jesus wasn't resurrected but authors of the Bible fabricated the whole story. To do so, they chose to use women as the primary witnesses, testimonies which would be immediately dismissed in court since only men were considered as trustworthy at the time. The women did not recognize who Jesus was. His followers did not even believe that he was resurrected. The gospel stories don't quite line up between the four. If you're trying to make up a story, why would you not work together to make it as sound and similar as possible with realistic witnesses? It would make no sense for the gospel writers to present the story in the way they did if they were making something up. \n\nWhat the Bible actually says.\n\n1) Jesus gives unity to all things. This is far superior to the social advances made by humanism. http://robbellcom.tumblr.com/post/69088463619/what-is-the-bible-part-19-the-verse-that-blows\n\n2) The Bible is not about being a good person or convincing yourself to have enough faith. Read the parables in Luke 15. What did the sheep do to earn his way back? He didn't do anything wrong by straying away, but certainly wasn't by his effort to save himself. Instead, the shepherd was willing to do something absurd to leave the other sheep behind and save it. What did the coin do? Again, this was linked to repentance. Once the sheep and coins talked in the parable of the two lost sons, how did the younger son repent? He came back only because of the famine and came back only hoping to improve his social status. Yet his father cut him off before he could sell himself out as a slave. What did the older son do to repent? He cut himself off from his brother and father by how he referred to them and by pouting outside of the house. Yet the father still welcomed him as a son. If Christianity was about what we do, none of that would be viewed as saving repentance. Yet the whole point is that all we need to do is be willing to be carried back to the flock. \n\n3) The message of the Bible is all about love (agape). One Corinthians 13:\n\nIf I speak in the tongues[a] of men or of angels, but do not have love, I am only a resounding gong or a clanging cymbal. 2 If I have the gift of prophecy and can fathom all mysteries and all knowledge, and if I have a faith that can move mountains, but do not have love, I am nothing. 3 If I give all I possess to the poor and give over my body to hardship that I may boast,[b] but do not have love, I gain nothing.\n\n4 Love is patient, love is kind. It does not envy, it does not boast, it is not proud. 5 It does not dishonor others, it is not self-seeking, it is not easily angered, it keeps no record of wrongs. 6 Love does not delight in evil but rejoices with the truth. 7 It always protects, always trusts, always hopes, always perseveres.\n\n8 Love never fails. But where there are prophecies, they will cease; where there are tongues, they will be stilled; where there is knowledge, it will pass away. 9 For we know in part and we prophesy in part, 10 but when completeness comes, what is in part disappears. 11 When I was a child, I talked like a child, I thought like a child, I reasoned like a child. When I became a man, I put the ways of childhood behind me. 12 For now we see only a reflection as in a mirror; then we shall see face to face. Now I know in part; then I shall know fully, even as I am fully known.\n\n13 And now these three remain: faith, hope and love. But the greatest of these is love.\n\nGot a bit long since I don't want to do homework, but hope that helps to anyone who was frustrated or even doubting from the event. Feel free to continue the conversation as well!", 
  "reactions": {
    "data": [
      {
        "id": "10210910847632864", 
        "name": "Sammi Pavett", 
        "type": "LIKE"
      }, 
      {
        "id": "10211506273078618", 
        "name": "Ally Enterline", 
        "type": "LIKE"
      }, 
      {
        "id": "1809883889024656", 
        "name": "Connor Lund", 
        "type": "LIKE"
      }, 
      {
        "id": "10212699740225924", 
        "name": "Peter Kelly", 
        "type": "LIKE"
      }, 
      {
        "id": "10159692032995134", 
        "name": "Brandon Roiger", 
        "type": "LIKE"
      }, 
      {
        "id": "1722263134471304", 
        "name": "Cole Anderson", 
        "type": "LIKE"
      }, 
      {
        "id": "1710378252326163", 
        "name": "Nick Anderson", 
        "type": "LIKE"
      }, 
      {
        "id": "1590799184292470", 
        "name": "Amy Yi", 
        "type": "LIKE"
      }, 
      {
        "id": "10210693817118409", 
        "name": "Amber Koehnen", 
        "type": "LIKE"
      }, 
      {
        "id": "10214791079794361", 
        "name": "Anna Hemze", 
        "type": "LIKE"
      }, 
      {
        "id": "10212733447989285", 
        "name": "Matt Almquist", 
        "type": "LIKE"
      }, 
      {
        "id": "10208146727706205", 
        "name": "Calvin Treichler", 
        "type": "LIKE"
      }, 
      {
        "id": "1764679770265571", 
        "name": "Kara Eckberg", 
        "type": "LIKE"
      }, 
      {
        "id": "10209859704281465", 
        "name": "Christopher Molenaar", 
        "type": "LIKE"
      }, 
      {
        "id": "10210589201029116", 
        "name": "Andrea Meitler", 
        "type": "LIKE"
      }, 
      {
        "id": "10213457272737717", 
        "name": "Erik Tungland", 
        "type": "LIKE"
      }, 
      {
        "id": "10214541165742552", 
        "name": "John Ke", 
        "type": "LIKE"
      }, 
      {
        "id": "1491567237559189", 
        "name": "Kaylee Sirovy", 
        "type": "LIKE"
      }, 
      {
        "id": "10208514289294470", 
        "name": "Chelsea Spencer", 
        "type": "LIKE"
      }, 
      {
        "id": "1922774227750507", 
        "name": "Sarah Strandmark", 
        "type": "LIKE"
      }, 
      {
        "id": "1878457152168690", 
        "name": "Matthew Eidem", 
        "type": "LIKE"
      }, 
      {
        "id": "10215581304751715", 
        "name": "David Nelson", 
        "type": "LIKE"
      }, 
      {
        "id": "10213485001751827", 
        "name": "Niccole Citlali Khail", 
        "type": "LIKE"
      }, 
      {
        "id": "1710090652356064", 
        "name": "Tayne Andersen", 
        "type": "LIKE"
      }, 
      {
        "id": "1989582057735588", 
        "name": "Josh Kelley", 
        "type": "LIKE"
      }, 
      {
        "id": "10212837471083319", 
        "name": "Jacklyn Nelson", 
        "type": "LIKE"
      }, 
      {
        "id": "1962573857092581", 
        "name": "Sungho Sohn", 
        "type": "LIKE"
      }, 
      {
        "id": "10214793639091461", 
        "name": "Kennedy Van Heerde", 
        "type": "LIKE"
      }, 
      {
        "id": "10203859786810345", 
        "name": "Lucy Bixby", 
        "type": "LIKE"
      }, 
      {
        "id": "10210913328729126", 
        "name": "Kristen Burton", 
        "type": "LIKE"
      }
    ], 
    "paging": {
      "cursors": {
        "after": "TVRJek1EQTRNak0wTXpveE5EVTJPVGMzT0RjME9qSTFOREE1TmpFMk1UTT0ZD", 
        "before": "TVRRd01qazRPRGM0T0RveE5EVTNPRGd4TURZAM09qSTFOREE1TmpFMk1UTT0ZD"
      }
    }
  }
}