{
  "comments": {
    "data": [
      {
        "created_time": "2016-06-23T04:47:06+0000", 
        "from": {
          "id": "10213053733991173", 
          "name": "Dan Zeller"
        }, 
        "id": "1721327601466783", 
        "message": "Awesome! And some advice from someone who didn't go on a summer mission to a regional partner location, don't be scared to go by yourself! You'll meet some incredible people and it'll be like you've been friends for life in no time. Seriously, not knowing anyone going in does not take away from the experience at all. I might even argue that it makes it better..."
      }, 
      {
        "created_time": "2016-06-23T04:51:41+0000", 
        "from": {
          "id": "10212837471083319", 
          "name": "Jacklyn Nelson"
        }, 
        "id": "1721329594799917", 
        "message": "I agree with Dan, I showed up for Chicago summer mission knowing absolutely nobody and it was great"
      }, 
      {
        "created_time": "2016-06-23T04:54:34+0000", 
        "from": {
          "id": "1991513320875521", 
          "name": "Emily Magnuson"
        }, 
        "id": "1721329968133213", 
        "message": "Thanks for the insight! That's actually what I experienced with TCX since I didn't know anyone going into it. I'll keep that in mind :)"
      }, 
      {
        "created_time": "2016-06-23T11:05:27+0000", 
        "from": {
          "id": "1969880233036990", 
          "name": "Jason Adlam"
        }, 
        "id": "1721408321458711", 
        "message": "Hi! Just a word of encouragement. I wouldn't look at the price of summer mission to determine where you go. Spend time in prayer to see where the Lord is leading you, and have that be the sole reason to go to a certain place! Yes, money and support raising is scary (I'm on one of the least expensive rn), but it really brings dependence on God and trusting Him to provide!\n\nAnd while Dan does have an incredible experience not going on a partnership summer mission, I'd encourage people to at least consider it. I'm currently building great community with people from other schools but most importantly, with those from the U, which we can bring back to our campus and continue to grow and go deeper. You get to see the people you went on mission with at most Cru conferences and makes it easier to have reunions as well. \n\nThat's just my heart as someone in North Myrtle.\n\nBut again, I'm so glad you feel like the Lord has guided you to a spot to go on a summer mission and the most important aspect of the location is where the Holy Spirit is leading you!"
      }, 
      {
        "created_time": "2016-06-23T12:18:41+0000", 
        "from": {
          "id": "1982288902036529", 
          "name": "Emily Wydo"
        }, 
        "id": "1721426584790218", 
        "message": "I second all of this, and I just want to mention how proud I am of you Em!!!!! Spend the next year in prayer about this as well (like Jason said) and anywhere you go, regardless of the people your with there is the always reminder than it doesn't even matter because it's all about Him. ☝🏼️ \n(Ps im considering going somewhere again, and I'll add this one in to the pile of \"prayerful maybe's\") 🙃"
      }, 
      {
        "created_time": "2016-06-23T12:23:22+0000", 
        "from": {
          "id": "1895709283776070", 
          "name": "Frances Gibson"
        }, 
        "id": "1721427731456770", 
        "message": "This sounds amazing! Especially being in one of Gods most beautiful places and taking the jump to do this! I have never done a summer mission but like you have had a fairly godless summer! I love this idea"
      }, 
      {
        "created_time": "2016-06-23T16:56:05+0000", 
        "from": {
          "id": "1991513320875521", 
          "name": "Emily Magnuson"
        }, 
        "id": "1721506668115543", 
        "message": "Thank you all for the wonderful advice! I'll keep it all in mind, and most importantly I'm definitely going to be praying on this to listen to what the Lord has in store for me in terms of a summer mission!"
      }
    ], 
    "paging": {
      "cursors": {
        "after": "WTI5dGJXVnVkRjlqZAFhKemIzSTZANVGN5TVRVd05qWTJPREV4TlRVME16b3hORFkyTnpBd09UWTEZD", 
        "before": "WTI5dGJXVnVkRjlqZAFhKemIzSTZANVGN5TVRNeU56WXdNVFEyTmpjNE16b3hORFkyTmpVM01qSTIZD"
      }
    }
  }, 
  "from": {
    "id": "1991513320875521", 
    "name": "Emily Magnuson"
  }, 
  "id": "1573851542881057_1721321734800703", 
  "message": "Dearest ladies/gents/kiddos/dogs,\nI've been thinking about next summer lately (yes I'm planning fairly far in advance) because unfortunately being home has produced a fairly Godless summer for me, and I saw some neato pics from the NMB kiddies, which got me thinking \"hey a summer mission that isn't too expensive & allows for a job is a perfect way to not only be able to earn the money I need in order to go to college during the not summer, but also gives the opportunity of growing closer with God!\" Long story short I went on the Cru website and discovered that there's more than NMB, or Paris, or Milwaukee and came across a summer mission in Yellowstone National Park. How wicked is that?! It's from May 29th-Aug 12th (11 weeks), you CAN get a job (yay!), and it costs $1850, which is a very reasonable amount to raise (plus a plane ticket which I also looked up to be about $300-400 roundtrip from MSP to BZN so more like $2300). I was wondering if there were any peeps out there in a similar predicament that would be interested in possibly going there next summer? I just think it would be a super neat & it would be nice to have a pal from the area to go with since we wouldn't be in Kansas anymore. This is all very theoretical at this point, I just wanted to get a feel for whether or nah there is anyone who loves a good national park and mountains and Jesus and wants to escape the suffocating environment of a fairly Godless home life for a summer. Hit me up if you're contemplating this, and even if the plans never actually solidify maybe we can be buds or something. Thank y'all for ya time.\nPeace and Love turtle doves.\n\nP.S. here is a pic of the beaut that is Yellowstone to coerce you into it", 
  "reactions": {
    "data": [
      {
        "id": "10211311977977287", 
        "name": "Katie Hannestad", 
        "type": "LIKE"
      }, 
      {
        "id": "10210910847632864", 
        "name": "Sammi Pavett", 
        "type": "LIKE"
      }, 
      {
        "id": "1768598043152636", 
        "name": "Emma Schwartz", 
        "type": "LIKE"
      }, 
      {
        "id": "10155970615304380", 
        "name": "Alec Joseph Oleson", 
        "type": "LIKE"
      }, 
      {
        "id": "2014622225218017", 
        "name": "Patricia Leach", 
        "type": "LIKE"
      }, 
      {
        "id": "10210763380061666", 
        "name": "Emma Jirele", 
        "type": "LIKE"
      }, 
      {
        "id": "1610321789024519", 
        "name": "Alyssa Eggert", 
        "type": "LIKE"
      }, 
      {
        "id": "1982288902036529", 
        "name": "Emily Wydo", 
        "type": "LIKE"
      }, 
      {
        "id": "10156143552337845", 
        "name": "Taylor Woodall", 
        "type": "LIKE"
      }, 
      {
        "id": "1684301964961108", 
        "name": "Lauren Arndt", 
        "type": "LIKE"
      }, 
      {
        "id": "915660251916466", 
        "name": "Micaela Schneider", 
        "type": "LIKE"
      }, 
      {
        "id": "1969880233036990", 
        "name": "Jason Adlam", 
        "type": "LIKE"
      }, 
      {
        "id": "1809883889024656", 
        "name": "Connor Lund", 
        "type": "LIKE"
      }, 
      {
        "id": "10209519133086942", 
        "name": "Andre Nelson", 
        "type": "LIKE"
      }, 
      {
        "id": "10215213997649049", 
        "name": "Liz Sampson", 
        "type": "LIKE"
      }, 
      {
        "id": "10210164788188609", 
        "name": "Mackenzie Darling", 
        "type": "LIKE"
      }, 
      {
        "id": "1710378252326163", 
        "name": "Nick Anderson", 
        "type": "LIKE"
      }, 
      {
        "id": "1694792690572124", 
        "name": "Amy Olsen", 
        "type": "LIKE"
      }, 
      {
        "id": "10213053733991173", 
        "name": "Dan Zeller", 
        "type": "LIKE"
      }, 
      {
        "id": "10213350226304092", 
        "name": "Nicholas Jackson", 
        "type": "LIKE"
      }, 
      {
        "id": "1645707085489633", 
        "name": "Krista Hamann", 
        "type": "LIKE"
      }, 
      {
        "id": "10212656145910015", 
        "name": "Shelby Larson", 
        "type": "LIKE"
      }
    ], 
    "paging": {
      "cursors": {
        "after": "TVRVM05qVXpPVFF4TmpveE5EWTJOalUyTmpVMU9qSTFOREE1TmpFMk1UTT0ZD", 
        "before": "TVRJNU5UUTBNREUzTXpveE5EWTJPREkzTlRFM09qSTFOREE1TmpFMk1UTT0ZD"
      }
    }
  }
}